//: [Day09-05.-访问控制-Access control](@previous)

// 视频教程-结构总结 https://www.hackingwithswift.com/sixty/7/13/structs-summary
// 测试: 惰性属性 https://www.hackingwithswift.com/review/structs-summary



/*:

 
 
 ## 静态属性和方法
 
 您已经完成了本系列的第七部分，让我们总结一下：

 您可以使用结构创建自己的类型，这些结构可以有自己的属性和方法。
 您可以使用存储的属性或使用计算的属性来动态计算值。
 如果要更改方法内的属性，则必须将其标记为mutating。
 初始化程序是创建结构的特殊方法。默认情况下，您会获得一个成员初始化程序，但如果您创建自己的初始化程序，则必须为所有属性赋值。
 使用self常量来引用方法内结构的当前实例。
 该lazy关键字告诉斯威夫特当第一次使用，他们只能创建属性。
 您可以使用static关键字在结构的所有实例之间共享属性和方法。
 访问控制允许您限制哪些代码可以使用属性和方法。

 
 */


//: [Day10-总结](@next)
