//: [Day09-06.-结构总结-Structs summary](@previous)
// 视频教程-班级总结 https://www.hackingwithswift.com/sixty/8/8/classes-summary




/*:
 
 ## 班级总结
 
 您已经完成了本系列的第八部分，让我们总结一下：

 类和结构很相似，因为它们都可以让您使用属性和方法创建自己的类型。
 一个类可以继承另一个类，并获得父类的所有属性和方法。谈论类层次结构是很常见的——一个类基于另一个类，而另一个类本身又基于另一个类。
 您可以使用final关键字标记一个类，这会阻止其他类从它继承。
 方法覆盖允许子类用新的实现替换其父类中的方法。
 当两个变量指向同一个类实例时，它们都指向同一块内存——改变一个会改变另一个。
 类可以有一个析构器，它是在类的实例被销毁时运行的代码。
 类不像结构那样强制执行常量——如果一个属性被声明为一个变量，那么无论类实例是如何创建的，它都可以被更改。

 */


//: [Day10-01.-创建自己的类-Creating your own classes](@next)
